app/Repositories/StockRepository.php

    public function getOrders($params = [])
    {
        $orders = $this->ordersModel
                ->select(
                    'orders.id',
                    'orders.order_id',
                    'orders.case_id',
                    'orders.created_at',
                    'orders.users_id',
                    'orders.sender_prefecture',
                    'orders.sender_city',
                    'orders.sender_sub_address',
                    'orders.sender_address',
                    'orders.is_hurry',
                    'users.display_name AS user_name',
                    'users.code AS user_code',
                    'suppliers.id AS supplier_id',
                    'suppliers.display_name AS supplier_name',
                    'm_products.code AS product_code',
                    'orders_suppliers.id AS orders_suppliers_id',
                    'orders_suppliers.ukey',
                    'orders_suppliers.item_unit',
                    'orders_suppliers.option1',
                    'orders_suppliers.last_commented_by',
                    'orders_suppliers.updated_at AS orders_suppliers_updated_at',
                )
                ->join('orders_suppliers', 'orders_suppliers.orders_id', '=', 'orders.id')
                ->join('suppliers', 'suppliers.id', '=', 'orders_suppliers.suppliers_id')
                ->join('m_products', 'm_products.id', '=', 'orders_suppliers.m_products_id')
                ->join('users', 'users.id', '=', 'orders.users_id')
                ->with('comments')
                ->orderBy('orders.updated_at', 'DESC')
                ->get();
---
select `orders`.`id`, `orders`.`order_id`, `orders`.`case_id`, `orders`.`created_at`, `orders`.`users_id`, `orders`.`sender_prefecture`, `orders`.`sender_city`, `orders`.`sender_sub_address`, `orders`.`sender_address`, `orders`.`is_hurry`, `users`.`display_name` as `user_name`, `users`.`code` as `user_code`, `suppliers`.`id` as `supplier_id`, `suppliers`.`display_name` as `supplier_name`, `m_products`.`code` as `product_code`, `orders_suppliers`.`id` as `orders_suppliers_id`, `orders_suppliers`.`ukey`, `orders_suppliers`.`item_unit`, `orders_suppliers`.`option1`, `orders_suppliers`.`last_commented_by`, `orders_suppliers`.`updated_at` as `orders_suppliers_updated_at` from `orders` inner join `orders_suppliers` on `orders_suppliers`.`orders_id` = `orders`.`id` inner join `suppliers` on `suppliers`.`id` = `orders_suppliers`.`suppliers_id` inner join `m_products` on `m_products`.`id` = `orders_suppliers`.`m_products_id` inner join `users` on `users`.`id` = `orders`.`users_id` order by `orders`.`updated_at` desc