app/Repositories/SuppliersRepository.php

select * from `suppliers` order by `code` asc
---
    public function getSuppliers()
    {
        $suppliers = $this->suppliersModel::orderBy('code', 'ASC')->get();